import pytest
import pandas as pd


@pytest.fixture
def fixture_df_data():
    data = {
        "Дата операции":"14-12-2021T12:05:59.000",
        "Дата платежа":"14.12.2021",
        "Номер карты":"*7197",
        "Статус":"OK",
        "Сумма операции":-309.0,
        "Валюта операции":"RUB",
        "Сумма платежа":-309.0,
        "Валюта платежа":"RUB",
        "Кэшбэк": 0,
        "Категория":"Супермаркеты",
        "MCC":5411.0,
        "Описание":"Колхоз",
        "Бонусы (включая кэшбэк)":6,
        "Округление на инвесткопилку":0,
        "Сумма операции с округлением":309.0
    }
    df = pd.DataFrame(data, index=[0])
    return df